app/controllers/companies_controller.rb

  def create
    @company = Company.new(company_params)

    respond_to do |format|
      if @company.save
---
INSERT INTO "companies" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-08-12 23:47:00.169527"], ["name", "Toledo"], ["updated_at", "2014-08-12 23:47:00.169527"]]