app/controllers/prices_controller.rb

  def create
    @price = Price.new(price_params)

    respond_to do |format|
      if @price.save
---
INSERT INTO "prices" ("company_id", "created_at", "end_at", "product_id", "starts_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["company_id", 1], ["created_at", "2014-10-29 03:06:54.864424"], ["end_at", "2014-10-29"], ["product_id", 3], ["starts_at", "2014-10-29"], ["updated_at", "2014-10-29 03:06:54.864424"]]

  def update
    respond_to do |format|
      if @price.update(price_params)
---
UPDATE "prices" SET "price" = ?, "updated_at" = ? WHERE "prices"."id" = 3  [["price", 351232.0], ["updated_at", "2014-09-09 00:17:39.721638"]]

  def destroy
    @price.destroy
---
DELETE FROM "prices" WHERE "prices"."id" = ?  [["id", 1]]

    def set_price
      @price = Price.find(params[:id])
---
SELECT  "prices".* FROM "prices"  WHERE "prices"."id" = ? LIMIT 1  [["id", 3]]