app/controllers/products_controller.rb

INSERT INTO "products" ("created_at", "description", "name", "product_category_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-08-13 00:38:33.292319"], ["description", "Volume 1 da Coleção"], ["name", "A Verdade da Vida Vol.1"], ["product_category_id", 1], ["updated_at", "2014-08-13 00:38:33.292319"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save