app/controllers/product_categories_controller.rb

  def index
    @product_categories = ProductCategory.all
---
SELECT "product_categories".* FROM "product_categories"

  def create
    @product_category = ProductCategory.new(product_category_params)

    respond_to do |format|
      if @product_category.save
---
INSERT INTO "product_categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-08-13 00:29:14.434215"], ["name", "Livro"], ["updated_at", "2014-08-13 00:29:14.434215"]]

  def update
    respond_to do |format|
      if @product_category.update(product_category_params)
---
UPDATE "product_categories" SET "name" = ?, "updated_at" = ? WHERE "product_categories"."id" = 9  [["name", "Fita1"], ["updated_at", "2014-09-09 00:01:50.997468"]]

  def destroy
    @product_category.destroy
---
DELETE FROM "product_categories" WHERE "product_categories"."id" = ?  [["id", 5]]

    def set_product_category
      @product_category = ProductCategory.find(params[:id])
---
SELECT  "product_categories".* FROM "product_categories"  WHERE "product_categories"."id" = ? LIMIT 1  [["id", 9]]