app/controllers/sells_controller.rb

SELECT "sells".* FROM "sells"
---
  def index
    @sells = Sell.all

INSERT INTO "sells" ("company_id", "created_at", "price_total", "product_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["company_id", 4], ["created_at", "2015-02-26 01:11:06.755633"], ["price_total", 30.0], ["product_id", 4], ["updated_at", "2015-02-26 01:11:06.755633"], ["user_id", 1]]
---
  def create
    @sell = Sell.new(sell_params)

    respond_to do |format|
      if @sell.save

DELETE FROM "sells" WHERE "sells"."id" = ?  [["id", 2]]
---
  def destroy
    @sell.destroy

SELECT  "sells".* FROM "sells"  WHERE "sells"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_sell
      @sell = Sell.find(params[:id])