app/controllers/stocks_controller.rb

INSERT INTO "stocks" ("company_id", "created_at", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?)  [["company_id", 1], ["created_at", "2014-09-08 23:04:39.909349"], ["product_id", 1], ["quantity", 10], ["updated_at", "2014-09-08 23:04:39.909349"]]
---
  def create
    @stock = Stock.new(stock_params)

    respond_to do |format|
      if @stock.save

UPDATE "stocks" SET "quantity" = ?, "updated_at" = ? WHERE "stocks"."id" = 1  [["quantity", 15], ["updated_at", "2014-09-09 00:24:52.150787"]]
---
  def update
    respond_to do |format|
      if @stock.update(stock_params)

SELECT  "stocks".* FROM "stocks"  WHERE "stocks"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_stock
      @stock = Stock.find(params[:id])