app/controllers/users_controller.rb

INSERT INTO "users" ("company_id", "created_at", "email", "encrypted_password", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "company_id" = ?, "encrypted_password" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["company_id", 1], ["encrypted_password", "$2a$10$vho.yR9T06wihkT7WyWDo.SUJH.stVB57et8nuRNz7mDTqsb8yuGC"], ["updated_at", "2014-08-26 23:32:05.130875"]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)